### Original Dataset: 'D0-KPMG_VI_New_raw_data_update_final.xlsx'

### Dataset used: 'D1-Customer-Information-Dataset.xlsx'

### Steps Followed
1. **Understanding Datasets ('N1-Study-of-Datasets.xlsx')**
  
2. **Data Quality Analysis/ Identify Data Issues ('Data-Preprocessing.ipynb' - Data Quality Analysis)**
    - Standard Quality Framework  
        2.1 Accuracy  
        2.2 Completeness  
        2.3 Consistency  
        2.4 Currency  
        2.5 Relevancy  
        2.6 Validity  
        2.7 Uniqueness  
3. **Recording Data Issues ('R1-Data-Quality-Assessment.xlsx' and 'R2-Data-Quality-Issues.docx')**
  
4. **Data Preprocessing/ Resolve Data Issues ('Data-Preprocessing.ipynb' - Data Preprocessing)**

5. **Generate Preprocessed Dataset ('D2-Preprocessed-Dataset.xlsx')**

## Importing Libraries and Datasets

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
rawdata_tx = pd.read_excel("D1-Customer-Information-Dataset.xlsx", sheet_name="Transactions")
rawdata_cd = pd.read_excel("D1-Customer-Information-Dataset.xlsx", sheet_name="CustomerDemographic")
rawdata_ca = pd.read_excel("D1-Customer-Information-Dataset.xlsx", sheet_name="CustomerAddress")

# Data Quality Analysis

In [3]:
def dirty_date(date_column):
    parsed_date = list(date_column.dt.day.unique())
    parsed_month = list(date_column.dt.month.unique())
    parsed_year = list(date_column.dt.year.unique())
    
    parsed_date.sort()
    parsed_month.sort()
    parsed_year.sort()
    
    print("dates: {0}\nmonth: {1}\nyear: {2}".format(parsed_date, parsed_month, parsed_year))

In [5]:
def values_in_categorical(dataset, cat_arr):
    for val in cat_arr:
        print('{0}: {1}'.format(val, dataset[val].unique()))
#(dataset['{3}'.format(val)].unique())))

## Dataset: Transactions

In [6]:
rawdata_tx.head().transpose()

,0,1,2,3,4
transaction_id,1,2,3,4,5
product_id,2,3,37,88,78
customer_id,2950,3120,402,3135,787
transaction_date,2017-02-25 00:00:00,2017-05-21 00:00:00,2017-10-16 00:00:00,2017-08-31 00:00:00,2017-10-01 00:00:00
online_order,0,1,0,0,1
order_status,Approved,Approved,Approved,Approved,Approved
brand,Solex,Trek Bicycles,OHM Cycles,Norco Bicycles,Giant Bicycles
product_line,Standard,Standard,Standard,Standard,Standard
product_class,medium,medium,low,medium,medium
product_size,medium,large,medium,medium,large
list_price,71.49,2091.47,1793.43,1198.46,1765.3
standard_cost,53.62,388.92,248.82,381.1,709.48
product_first_sold_date,41245,41701,36361,36145,42226

In [7]:
rawdata_tx.describe(include = 'all')

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,20000,19640.000000,20000,19803,19803,19803,19803,20000.000000,19803.000000,19803.000000
unique,NaN,NaN,NaN,364,NaN,2,6,4,3,3,NaN,NaN,NaN
top,NaN,NaN,NaN,2017-02-14 00:00:00,NaN,Approved,Solex,Standard,medium,medium,NaN,NaN,NaN
freq,NaN,NaN,NaN,82,NaN,19821,4253,14176,13826,12990,NaN,NaN,NaN
first,NaN,NaN,NaN,2017-01-01 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,NaN,2017-12-30 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,10000.500000,45.36465,1738.246050,NaN,0.500458,NaN,NaN,NaN,NaN,NaN,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,NaN,0.500013,NaN,NaN,NaN,NaN,NaN,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,NaN,0.000000,NaN,NaN,NaN,NaN,NaN,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,NaN,0.000000,NaN,NaN,NaN,NaN,NaN,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,2091.470000,1759.850000,42710.000000

### Missing Values
0: transaction_id, product_id, customer_id, transaction_date, order_status, list_price 	
197: brand, product_line, product_class, product_size, standard_cost, product_first_sold_date   
360: online_order

### Identify: Identity Variables

transaction_id
product_id
customer_id

### Identify: Unique String Values in Categorical Variables

In [8]:
values_in_categorical(rawdata_tx, ['order_status', 'brand', 'product_line', 'product_class', 'product_size'])

order_status: ['Approved' 'Cancelled']
brand: ['Solex' 'Trek Bicycles' 'OHM Cycles' 'Norco Bicycles' 'Giant Bicycles'
 'WeareA2B' nan]
product_line: ['Standard' 'Road' 'Mountain' 'Touring' nan]
product_class: ['medium' 'low' 'high' nan]
product_size: ['medium' 'large' 'small' nan]

### Identify: Datatypes of all attributes

In [9]:
rawdata_tx.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

### Validate Date Column

In [10]:
dirty_date(rawdata_tx['transaction_date'])

dates: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]
month: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
year: [2017]

### Duplicate Records

# SQL Query
SELECT rawdata_tx['transaction_id'], COUNT(*) AS freq_count
FROM rawdata_tx 
WHERE freq_count > 1
GROUP BY rawdata_tx['transaction_id']

In [11]:
rawdata_tx[rawdata_tx.duplicated()]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

No duplicated records in the dataset

## Dataset: CustomerDemographic

In [12]:
rawdata_cd.head().transpose()

,0,1,2,3,4
customer_id,1,2,3,4,5
first_name,Laraine,Eli,Arlin,Talbot,Sheila-kathryn
last_name,Medendorp,Bockman,Dearle,NaN,Calton
gender,F,Male,Male,Male,Female
past_3_years_bike_related_purchases,93,81,61,33,56
DOB,1953-10-12 00:00:00,1980-12-16 00:00:00,1954-01-20 00:00:00,1961-10-03 00:00:00,1977-05-13 00:00:00
job_title,Executive Secretary,Administrative Officer,Recruiting Manager,NaN,Senior Editor
job_industry_category,Health,Financial Services,Property,IT,NaN
wealth_segment,Mass Customer,Mass Customer,Mass Customer,Mass Customer,Affluent Customer
deceased_indicator,N,N,N,N,N
default,"""'",<script>alert('hi')</script>,2018-02-01 00:00:00,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,NIL
owns_car,Yes,Yes,Yes,No,Yes
tenure,11,16,15,7,8

In [13]:
rawdata_cd.describe(include = 'all')

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
count,4000.000000,4000,3875,4000,4000.000000,3913,3494,3344,4000,4000,3698.0,4000,3913.000000
unique,NaN,3139,3725,6,NaN,3448,195,9,3,2,90.0,2,NaN
top,NaN,Max,Pristnor,Female,NaN,1978-01-30 00:00:00,Business Systems Development Analyst,Manufacturing,Mass Customer,N,100.0,Yes,NaN
freq,NaN,5,3,2037,NaN,7,45,799,2000,3998,113.0,2024,NaN
first,NaN,NaN,NaN,NaN,NaN,1843-12-21 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,NaN,NaN,NaN,2002-03-11 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,2000.500000,NaN,NaN,NaN,48.890000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10.657041
std,1154.844867,NaN,NaN,NaN,28.715005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.660146
min,1.000000,NaN,NaN,NaN,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.000000
25%,1000.750000,NaN,NaN,NaN,24.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.000000
50%,2000.500000,NaN,NaN,NaN,48.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.000000
75%,3000.250000,NaN,NaN,NaN,73.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.000000
max,4000.000000,NaN,NaN,NaN,99.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,22.000000

### Missing Values
0: customer_id, first_name, gender, past_3_years_bike_related_purchases, wealth_segment, deceased_indicator, owns_car 87: DOB, tenure 	
125: last_name
302: default
506: job_title
656: job_industry_category

### Identify: Identity Variables

customer_id
[first_name, last_name]

### Identify: Unique String Values in Categorical Variables

In [14]:
# Categorical variable 'job_title' has 45 unique values. Hence, ignoring it. 
values_in_categorical(rawdata_cd, ['gender', 'job_industry_category', 'wealth_segment', 'deceased_indicator', 'owns_car'])

gender: ['F' 'Male' 'Female' 'U' 'Femal' 'M']
job_industry_category: ['Health' 'Financial Services' 'Property' 'IT' nan 'Retail' 'Argiculture'
 'Manufacturing' 'Telecommunications' 'Entertainment']
wealth_segment: ['Mass Customer' 'Affluent Customer' 'High Net Worth']
deceased_indicator: ['N' 'Y']
owns_car: ['Yes' 'No']

'gender' attribute has only 3 unique values despite of present 6 values. Categorising as follows:
Male: ['Male', 'M']
Female: ['Female', 'F', 'Femal']
Other: ['U']

### Identify: Datatypes of all attributes

In [15]:
rawdata_cd.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

### Validate Date Column

In [16]:
dirty_date(rawdata_cd['DOB'])

dates: [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0, 21.0, 22.0, 23.0, 24.0, 25.0, 26.0, 27.0, 28.0, 29.0, 30.0, 31.0, nan]
month: [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, nan]
year: [1843.0, 1931.0, 1935.0, 1940.0, 1943.0, 1944.0, 1953.0, 1954.0, 1955.0, 1956.0, 1957.0, 1958.0, 1959.0, 1960.0, 1961.0, 1962.0, 1963.0, 1964.0, 1965.0, 1966.0, 1967.0, 1968.0, 1969.0, 1970.0, 1971.0, 1972.0, 1973.0, 1974.0, 1975.0, 1976.0, 1977.0, 1978.0, 1979.0, 1980.0, 1981.0, 1982.0, 1983.0, 1984.0, 1985.0, 1986.0, 1987.0, 1988.0, 1989.0, 1990.0, 1991.0, 1992.0, 1993.0, 1994.0, 1995.0, 1996.0, 1997.0, 1998.0, 1999.0, 2000.0, 2001.0, 2002.0, nan]

### Duplicate Records

In [17]:
rawdata_cd[rawdata_tx.duplicated()]

C:\Users\prabo\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, default, owns_car, tenure]
Index: []

No duplicated records in the dataset

## Dataset: CustomerAddress

In [18]:
rawdata_ca.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [19]:
rawdata_ca.describe(include="all")

,customer_id,address,postcode,state,country,property_valuation
count,3999.000000,3999,3999.000000,3999,3999,3999.000000
unique,NaN,3996,NaN,5,1,NaN
top,NaN,3 Mariners Cove Terrace,NaN,NSW,Australia,NaN
freq,NaN,2,NaN,2054,3999,NaN
mean,2003.987997,NaN,2985.755939,NaN,NaN,7.514379
std,1154.576912,NaN,844.878364,NaN,NaN,2.824663
min,1.000000,NaN,2000.000000,NaN,NaN,1.000000
25%,1004.500000,NaN,2200.000000,NaN,NaN,6.000000
50%,2004.000000,NaN,2768.000000,NaN,NaN,8.000000
75%,3003.500000,NaN,3750.000000,NaN,NaN,10.000000
max,4003.000000,NaN,4883.000000,NaN,NaN,12.000000

No missing values in the dataset

In [20]:
rawdata_ca.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [21]:
print("state: ", rawdata_ca['state'].unique())

state:  ['New South Wales' 'QLD' 'VIC' 'NSW' 'Victoria']

# Data Preprocessing

## Dataset: Transactions

### Feature Transformation: 'transaction_date' to 'purchase_month

In [22]:
rawdata_tx['purchase_month'] = pd.DatetimeIndex(rawdata_tx['transaction_date']).month

### Encoding Categorical Variables

In [23]:
encoding_dict_tx = {
    "product_class":  {'nan':0, 'low':1,'medium':2, 'high':3},
    "product_size":  {'nan':0, 'small':1, 'medium':2, 'large':3},
    "order_status": {'Approved':1, 'Cancelled':0},
    "brand": {'Solex':1, 'Trek Bicycles':2, 'OHM Cycles':3, 'Norco Bicycles':4, 'Giant Bicycles':5, 'WeareA2B':6, 'nan':0},
    "product_line": {'nan':0, 'Standard':1, 'Road':2, 'Mountain':3, 'Touring':4}
}

In [24]:
rawdata_tx = rawdata_tx.replace(encoding_dict_tx)

**Further two major transformations are desirable in this dataset. They are as follows -**   
1. Generate New Variable 'sales_profit' using 'standard_cost' and 'list_price'
2. Missing values treatment 

We shall discuss two possible approaches for it below. 

**Approach 1: Eliminate 197 records where 'standard_cost' has missing values as 'sales_profit' can not be determined.**
- 'sales_profit' ranges between [4.80, 1702.55]

**Approach 2: Substitute missing values in 'standard_cost' with median value**  
- If the 'standard_cost' is substituted, generated variable 'sales_profit' ranges between [-491.50, 1702.55]
- Thus, substitution biased the 'sales_profit', which is undesirable. 
- Henceforth, eliminating records where 'sales_profit' is less than 4.80 leaves our dataset with 19803 records (i.e. 197 records eliminated)
- With this apporach, we are left with same distribution of values in 'sales_profit' as in Approach 1.

Thus, the dataset has left us with same number of valid records after using both approaches, whereas it has become more complex using Approach 2. Hence, selecting Approach 1.

### Missing Value Treatment

In [26]:
rawdata_tx.dropna(subset=['standard_cost'], axis=0, inplace=True)

### Generate New Variable: 'sales_profit'
Generate new variable 'sales_profit' using 'standard_cost' and 'list_price'

In [28]:
rawdata_tx['sales_profit'] = rawdata_tx['list_price'] - rawdata_tx['standard_cost']

# Approach 2  
prepdata_tx['standard_cost'] = prepdata_tx['standard_cost'].fillna(prepdata_tx['standard_cost'].median())  
prepdata_tx.drop(prepdata_tx[prepdata_tx['sales_profit']<4.80].index, axis=0, inplace=True)  

# prepdata_tx['standard_cost'].mean()  
# prepdata_tx.describe()

### Drop 'Cancelled' orders

In [30]:
rawdata_tx['order_status'].sum()
# 19625 valid orders have generated profit to the store

19625

In [31]:
rawdata_tx.drop(rawdata_tx[rawdata_tx['order_status']==0].index, axis=0, inplace=True)

### Drop Unnecessary Attributes

In [35]:
rawdata_tx.drop(['transaction_id', 'product_id', 'transaction_date', 'order_status', 'brand', 'product_line', 'product_class', 'product_size', 'list_price', 'standard_cost', 'product_first_sold_date'], axis=1, inplace=True)

In [57]:
rawdata_tx.describe()

        customer_id  online_order  purchase_month  sales_profit
count  19625.000000  19273.000000    19625.000000  19625.000000
mean    1739.572994      0.500285        6.515465    551.923772
std     1011.957495      0.500013        3.450317    493.502909
min        1.000000      0.000000        1.000000      4.800000
25%      858.000000      0.000000        4.000000    133.780000
50%     1737.000000      1.000000        7.000000    445.210000
75%     2615.000000      1.000000       10.000000    830.240000
max     5034.000000      1.000000       12.000000   1702.550000

Variable **'online_order'** has 552 missing records. We will analyse it's relationship with location of customer i.e. **'state'** variable in **"CustomerAddress"** dataset.

In [39]:
prepdata_tx = rawdata_tx

## Dataset: CustomerDemographic

### Feature Transformation: 'DOB' to 'age'

In [40]:
rawdata_cd['DOB'] = pd.to_datetime(rawdata_cd['DOB'])

In [41]:
rawdata_cd['age'] = 2017 - rawdata_cd['DOB'].dt.year

### Encoding Categorical Variables

In [42]:
encoding_dict_cd = {
    "gender": {'F':1, 'Female':1, 'Femal':1, 'U':2, 'Male':0, 'M':0},
    "job_industry_category": {'Health':1, 'Financial Services':2, 'Property':3, 'IT':4, 'nan':0, 'Retail':5, 
                              'Argiculture':6, 'Manufacturing':7, 'Telecommunications':8, 'Entertainment':9},
    "wealth_segment": {'Mass Customer':1, 'Affluent Customer':2, 'High Net Worth':3},
    "deceased_indicator": {'N':0, 'Y':1},
    "owns_car": {"Yes":1, "No":0}
}

In [43]:
rawdata_cd = rawdata_cd.replace(encoding_dict_cd)

### Eliminated 'deceased' records

In [44]:
rawdata_cd.drop(rawdata_cd[rawdata_cd['deceased_indicator']==1].index, axis=0, inplace=True)

### Drop Unnecessary Attributes

In [45]:
rawdata_cd = rawdata_cd.drop(['first_name', 'last_name', 'DOB', 'job_title', 'job_industry_category', 'deceased_indicator', 'default'], axis=1)

In [58]:
rawdata_cd.describe()

,customer_id,gender,past_3_years_bike_related_purchases,wealth_segment,owns_car,tenure,age
count,3998.000000,3998.000000,3998.000000,3998.000000,3998.000000,3911.000000,3911.000000
mean,2000.364432,0.553777,48.871186,1.755378,0.505753,10.658655,39.962925
std,1154.618313,0.539632,28.709682,0.834093,0.500029,5.661042,12.795916
min,1.000000,0.000000,0.000000,1.000000,0.000000,1.000000,15.000000
25%,1001.250000,0.000000,24.000000,1.000000,0.000000,6.000000,30.000000
50%,2000.500000,1.000000,48.000000,1.500000,1.000000,11.000000,40.000000
75%,2999.750000,1.000000,73.000000,3.000000,1.000000,15.000000,49.000000
max,4000.000000,2.000000,99.000000,3.000000,1.000000,22.000000,174.000000

87 missing values for variables 'tenure' and 'age'.

In [48]:
prepdata_cd = rawdata_cd

## Dataset: CustomerAddress

### Feature Encoding: 'state'

In [49]:
encoding_dict_ca = {
    "state": {'New South Wales':2, 'QLD':1, 'VIC':3, 'NSW':2, 'Victoria':3}
}

In [50]:
rawdata_ca = rawdata_ca.replace(encoding_dict_ca)

### Drop Unnecessary Attributes

In [51]:
rawdata_ca = rawdata_ca.drop(['address', 'postcode', 'country'], axis=1)

In [59]:
rawdata_ca.describe()

       customer_id        state  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997     2.045761            7.514379
std    1154.576912     0.680359            2.824663
min       1.000000     1.000000            1.000000
25%    1004.500000     2.000000            6.000000
50%    2004.000000     2.000000            8.000000
75%    3003.500000     3.000000           10.000000
max    4003.000000     3.000000           12.000000

No missing values.

In [55]:
prepdata_ca = rawdata_ca

## Exporting Datasets

In [60]:
custdata = pd.merge(left=prepdata_cd, right=prepdata_ca, how='left', left_on='customer_id', right_on='customer_id')

In [62]:
custdata.describe()

,customer_id,gender,past_3_years_bike_related_purchases,wealth_segment,owns_car,tenure,age,state,property_valuation
count,3998.000000,3998.000000,3998.000000,3998.000000,3998.000000,3911.000000,3911.000000,3994.000000,3994.000000
mean,2000.364432,0.553777,48.871186,1.755378,0.505753,10.658655,39.962925,2.045819,7.516274
std,1154.618313,0.539632,28.709682,0.834093,0.500029,5.661042,12.795916,0.680415,2.824326
min,1.000000,0.000000,0.000000,1.000000,0.000000,1.000000,15.000000,1.000000,1.000000
25%,1001.250000,0.000000,24.000000,1.000000,0.000000,6.000000,30.000000,2.000000,6.000000
50%,2000.500000,1.000000,48.000000,1.500000,1.000000,11.000000,40.000000,2.000000,8.000000
75%,2999.750000,1.000000,73.000000,3.000000,1.000000,15.000000,49.000000,3.000000,10.000000
max,4000.000000,2.000000,99.000000,3.000000,1.000000,22.000000,174.000000,3.000000,12.000000

We will analyze the reasons for missing values in following variables and implement appropriate methods for imputations.
Missing Values:
4: 'state', 'property_valuation'
87: 'tenure', 'age'

In [65]:
with pd.ExcelWriter("D2-Preprocessed-Dataset.xlsx") as writer:
    prepdata_tx.to_excel(writer, sheet_name="Transactions", index=False)
    custdata.to_excel(writer, sheet_name="CustomerInfo", index=False)